Emacs.org
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args:bash       :tangle-mode (identity #o755) :comments link :shebang "#!/usr/bin/env bash"
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes :eval never-export :exports both
#+TODO: CHECK(s) | OFF(o)
#+TITLE: Emacs config
#+OPTIONS: broken-links:auto h:6 toc:nil

#+begin_quote
One day we won't hate one another, no young boy will march to war and I will clean up my Emacs config. But that day isn't today.
#+end_quote

* Introduction
My configuration of [[https://www.gnu.org/software/emacs/][GNU Emacs]], an awesome +text editor+ program that can do almost anything.

At the moment of this writing, this "almost anything" includes:
- *Writing code*. With LSP & Co this functionality of Emacs may rival that of IDEs, and is at least on par with editors like VS Code.\\
  One thing where Emacs is particularly good is writing Lisp code, e.g. Clojure, Common Lisp, and, of course, Emacs Lisp.
- *Literate programming* with Org Mode. That includes:
  - Configuring the entirety of my software (that can be configured with text files).
  - Interactive programming like one provided by Jupyter Notebook.
- *File management*. Dired is my primary file manager.
- *Email*, with notmuch.
- *Multimedia management*, with EMMS.
- *RSS feed reader*, with elfeed.
- *Task management*, with Org Mode.
- *Managing passwords*, with pass.
- *IRC*, with ERC.
- *Formatting documents*, also with Org Mode. When the document is too complex, I prefer to write plain LaTeX, but I've come to the conclusion that in most cases Org Mode covers my needs there.
- *X Window management*, with EXWM. So I could say I literally live in Emacs.
- ...

As I have hinted above, this file is a piece of literate configuration, which means that the actual code is interweaved with English-language commentary. One could argue that the commentary, not the code, is the primary entity of the file.

But at the same time, the configuration is personal, so the primary benefactor of the literate structure is me. The commentary is primarily meant to capture my state of mind at the moment of writing the code, which is immensely helpful for maintaining the code in the future. So the quality and quantity of the commentary are... varying.

Occasionally I save some promising experimentations from scratch buffers without much comment. Or I may not have enough time to describe things in substantial detail. Or, as it is at the moment when I'm writing this, I have the time to write down whatever I consider necessary. Or, when I'm writing a blog post about Emacs configuration, I usually incorporate some things back into this config.

And of course, human minds share many similarities, so if you are an avid Emacs user, you probably can extract something of value from here. Although in this case, your configuration has a decent chance to have everything I'm doing here. But who knows, because somehow mine is over 6000 LoC at the moment, despite being just a bit over a year old.

If however, by some twist of fate, this document is one of the first things you see about Emacs, it won't be a good resource for you. And you definitely shouldn't try to launch this config as it is. If I could suggest only one resource, I'd advise David Wilson's [[https://www.youtube.com/c/SystemCrafters][System Crafters]] YouTube channel.

#+TOC: headlines 6

* Contents                                                         :noexport:
:PROPERTIES:
:TOC:      :include all :depth 4
:END:
:CONTENTS:
- [[#introduction][Introduction]]
- [[#some-remarks][Some remarks]]
- [[#bootstrap][Bootstrap]]
  - [[#packages][Packages]]
    - [[#straightel][straight.el]]
    - [[#use-package][use-package]]
  - [[#variables--environment][Variables & environment]]
  - [[#performance][Performance]]
    - [[#measure-startup-speed][Measure startup speed]]
    - [[#garbage-collection][Garbage collection]]
    - [[#run-garbage-collection-when-emacs-is-unfocused][Run garbage collection when Emacs is unfocused]]
    - [[#native-compilation][Native compilation]]
  - [[#anaconda][Anaconda]]
  - [[#config-files][Config files]]
    - [[#custom-file-location][Custom file location]]
    - [[#authinfo][authinfo]]
    - [[#private-config][Private config]]
    - [[#no-littering][No littering]]
  - [[#prevent-emacs-from-closing][Prevent Emacs from closing]]
- [[#general-settings][General settings]]
  - [[#keybindings][Keybindings]]
    - [[#generalel][general.el]]
    - [[#which-key][which-key]]
    - [[#evil][Evil]]
    - [[#my-keybindings][My keybindings]]
  - [[#i3-integration][i3 integration]]
  - [[#editing-text][Editing text]]
    - [[#indentation--whitespace][Indentation & whitespace]]
    - [[#settings][Settings]]
    - [[#undo-tree][Undo Tree]]
    - [[#snippets][Snippets]]
    - [[#other-small-packages][Other small packages]]
  - [[#working-with-projects][Working with projects]]
    - [[#projectile][Projectile]]
    - [[#git--magit][Git & Magit]]
    - [[#editorconfig][Editorconfig]]
  - [[#completion][Completion]]
    - [[#ivy-counsel-swiper][Ivy, counsel, swiper]]
    - [[#ivy-rich][ivy-rich]]
    - [[#prescient][prescient]]
    - [[#keybindings][keybindings]]
    - [[#company][company]]
  - [[#help][Help]]
  - [[#time-trackers][Time trackers]]
    - [[#wakatime][WakaTime]]
    - [[#activitywatch][ActivityWatch]]
- [[#ui-settings][UI settings]]
  - [[#general-settings][General settings]]
    - [[#miscellaneous][Miscellaneous]]
    - [[#line-numbers][Line numbers]]
    - [[#word-wrapping][Word wrapping]]
    - [[#custom-frame-format][Custom frame format]]
  - [[#themes-and-colors][Themes and colors]]
    - [[#doom-themes][Doom themes]]
    - [[#custom-theme][Custom theme]]
    - [[#dim-inactive-buffers][Dim inactive buffers]]
  - [[#fonts][Fonts]]
    - [[#frame-font][Frame font]]
    - [[#ligatures][Ligatures]]
    - [[#icons][Icons]]
  - [[#text-highlight][Text highlight]]
  - [[#doom-modeline][Doom Modeline]]
  - [[#perspectiveel][perspective.el]]
    - [[#functions-to-manage-buffers][Functions to manage buffers]]
    - [[#automating-perspectives][Automating perspectives]]
- [[#programming][Programming]]
  - [[#general-setup][General setup]]
    - [[#treemacs][Treemacs]]
    - [[#lsp][LSP]]
    - [[#flycheck][Flycheck]]
    - [[#tree-sitter][Tree Sitter]]
    - [[#dap][DAP]]
    - [[#reformatter][Reformatter]]
    - [[#general-additional-config][General additional config]]
  - [[#web-development][Web development]]
    - [[#emmet][Emmet]]
    - [[#prettier][Prettier]]
    - [[#typescript][TypeScript]]
    - [[#javascript][JavaScript]]
    - [[#jest][Jest]]
    - [[#web-mode][web-mode]]
    - [[#scss][SCSS]]
    - [[#php][PHP]]
  - [[#latex][LaTeX]]
    - [[#auctex][AUCTeX]]
    - [[#bibtex][BibTeX]]
    - [[#import-sty][Import *.sty]]
    - [[#snippets][Snippets]]
  - [[#other-markup--natural-languages][Other markup & natural languages]]
    - [[#markdown][Markdown]]
    - [[#plantuml][PlantUML]]
    - [[#subtitles][Subtitles]]
    - [[#languagetool][LanguageTool]]
  - [[#lisp][Lisp]]
    - [[#meta-lisp][Meta Lisp]]
    - [[#emacs-lisp][Emacs Lisp]]
    - [[#common-lisp][Common lisp]]
    - [[#clojure][Clojure]]
    - [[#hy][Hy]]
    - [[#scheme][Scheme]]
    - [[#clips][CLIPS]]
  - [[#python][Python]]
    - [[#pipenv][pipenv]]
    - [[#yapf][yapf]]
    - [[#isort][isort]]
    - [[#sphinx-doc][sphinx-doc]]
    - [[#pytest][pytest]]
    - [[#code-cells][code-cells]]
    - [[#tensorboard][tensorboard]]
  - [[#data-serialization][Data serialization]]
    - [[#json][JSON]]
    - [[#csv][CSV]]
    - [[#yaml][YAML]]
  - [[#configuration][Configuration]]
    - [[#env][.env]]
    - [[#gitignore][.gitignore]]
    - [[#docker][Docker]]
    - [[#crontab][crontab]]
  - [[#shell][Shell]]
    - [[#sh][sh]]
    - [[#fish][fish]]
  - [[#java][Java]]
  - [[#go][Go]]
  - [[#net][.NET]]
    - [[#c][C#]]
    - [[#msbuild][MSBuild]]
  - [[#haskell][Haskell]]
  - [[#nix][nix]]
  - [[#lua][Lua]]
  - [[#sql][SQL]]
  - [[#sparql][SPARQL]]
- [[#org-mode][Org Mode]]
  - [[#installation--basic-settings][Installation & basic settings]]
    - [[#encryption][Encryption]]
    - [[#org-contrib][org-contrib]]
  - [[#integration-with-evil][Integration with evil]]
  - [[#literate-programing][Literate programing]]
    - [[#python--jupyter][Python & Jupyter]]
    - [[#hy][Hy]]
    - [[#view-html-in-browser][View HTML in browser]]
    - [[#plantuml][PlantUML]]
    - [[#setup][Setup]]
    - [[#managing-jupyter-kernels][Managing Jupyter kernels]]
    - [[#output-post-processing][Output post-processing]]
    - [[#managing-a-literate-programming-project][Managing a literate programming project]]
  - [[#tools][Tools]]
    - [[#presentations][Presentations]]
    - [[#toc][TOC]]
    - [[#screenshots][Screenshots]]
    - [[#transclusion][Transclusion]]
  - [[#productivity--knowledge-management][Productivity & Knowledge management]]
    - [[#capture-templates--various-settings][Capture templates & various settings]]
    - [[#trello-sync][Trello sync]]
    - [[#org-ql][org-ql]]
    - [[#custom-agendas][Custom agendas]]
    - [[#org-journal][Org Journal]]
    - [[#org-roam][Org Roam]]
    - [[#review-workflow][Review workflow]]
    - [[#org-ref][org-ref]]
    - [[#org-roam-bibtex][org-roam-bibtex]]
    - [[#org-contacts][org-contacts]]
    - [[#managing-tables][Managing tables]]
  - [[#ui][UI]]
    - [[#off-instant-equations-preview][(OFF) Instant equations preview]]
    - [[#latex-fragments][LaTeX fragments]]
    - [[#better-headers][Better headers]]
    - [[#override-colors][Override colors]]
  - [[#export][Export]]
    - [[#general-settings][General settings]]
    - [[#hugo][Hugo]]
    - [[#jupyter-notebook][Jupyter Notebook]]
    - [[#html-export][Html export]]
    - [[#latex][LaTeX]]
  - [[#keybindings--stuff][Keybindings & stuff]]
    - [[#general-keybindings][General keybindings]]
    - [[#copy-a-link][Copy a link]]
    - [[#open-a-file-from-org-directory][Open a file from org-directory]]
  - [[#system-configuration][System configuration]]
    - [[#tables-for-guix-dependencies][Tables for Guix Dependencies]]
    - [[#noweb-evaluations][Noweb evaluations]]
    - [[#yadm-hook][yadm hook]]
- [[#applications][Applications]]
  - [[#dired][Dired]]
    - [[#basic-config--keybindings][Basic config & keybindings]]
    - [[#addons][Addons]]
    - [[#subdirectories][Subdirectories]]
    - [[#tramp][TRAMP]]
    - [[#bookmarks][Bookmarks]]
  - [[#shells][Shells]]
    - [[#vterm][vterm]]
    - [[#eshell][Eshell]]
  - [[#managing-dotfiles][Managing dotfiles]]
    - [[#open-emacs-config][Open Emacs config]]
    - [[#open-magit-for-yadm][Open Magit for yadm]]
    - [[#open-a-dotfile][Open a dotfile]]
  - [[#internet--multimedia][Internet & Multimedia]]
    - [[#notmuch][Notmuch]]
    - [[#elfeed][Elfeed]]
    - [[#emms][EMMS]]
    - [[#ytel][ytel]]
    - [[#eww][EWW]]
    - [[#erc][ERC]]
    - [[#off-jabber][(OFF) jabber]]
    - [[#google-translate][Google Translate]]
  - [[#reading-documentation][Reading documentation]]
    - [[#tldr][tldr]]
    - [[#man--info][man & info]]
    - [[#devdocsio][devdocs.io]]
  - [[#utilities][Utilities]]
    - [[#pass][pass]]
    - [[#docker][Docker]]
    - [[#progidy][Progidy]]
    - [[#screenshotel][screenshot.el]]
    - [[#proced][proced]]
    - [[#guix][Guix]]
  - [[#productivity][Productivity]]
    - [[#pomm][pomm]]
    - [[#hledger][hledger]]
    - [[#calendar][Calendar]]
  - [[#fun][Fun]]
    - [[#discord-integration][Discord integration]]
    - [[#snow][Snow]]
    - [[#power-mode][Power mode]]
    - [[#redacted][Redacted]]
    - [[#zone][Zone]]
- [[#guix-settings][Guix settings]]
:END:
* Some remarks
I decided not to keep configs for features that I do not use anymore because this config is already huge. But here are the last commits that had these features presented.

| Feature           | Last commit                              |
|-------------------+------------------------------------------|
| org-roam dailies  | d2648918fcc338bd5c1cd6d5c0aa60a65077ccf7 |
| org-roam projects | 025278a1e180e86f3aade20242e4ac1cdc1a2f13 |
| treemacs          | 3d87852745caacc0863c747f1fa9871d367240d2 |
| tab-bar.el        | 19ff54db9fe21fd5bdf404a8d2612176baa8a6f5 |
| spaceline         | 19ff54db9fe21fd5bdf404a8d2612176baa8a6f5 |
| code compass      | 8594d6f53e42c70bbf903e168607841854818a38 |
| vue-mode          | 8594d6f53e42c70bbf903e168607841854818a38 |
| svelte-mode       | 8594d6f53e42c70bbf903e168607841854818a38 |
| pomidor           | 8594d6f53e42c70bbf903e168607841854818a38 |
* Bootstrap
Setting up the environment, performance tuning and a few basic settings.

** Packages
*** straight.el
Straight.el is my Emacs package manager of choice. Its advantages & disadvantages over other options are listed pretty thoroughly in the README file in the repo.

The following is a straight.el bootstrap script.

References:
- [[https://github.com/raxod502/straight.el][straight.el repo]]

#+begin_src emacs-lisp :noweb-ref minimal
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage))
#+end_src
*** use-package
A macro to simplify package specification & configuration. Integrates with straight.el.

Set ~use-package-verbose~ to ~t~ to print out individual package loading time.

References:
- [[https://github.com/jwiegley/use-package][use-package repo]]

#+begin_src emacs-lisp :noweb-ref minimal
(straight-use-package 'use-package)
(eval-when-compile (require 'use-package))
#+end_src
** Variables & environment
This section is about optioning the Emacs config.

The following variable is true when my machine is not powerful enough for some resource-heavy packages.
#+begin_src emacs-lisp
(setq my/lowpower (string= (system-name) "azure"))
#+end_src

The following is true if Emacs is meant to be used with TRAMP over slow ssh. Take a look at the [[*TRAMP][TRAMP]] section for more details.
#+begin_src emacs-lisp
  (setq my/slow-ssh
        (or
         (string= (getenv "IS_TRAMP") "true")
         (string= (system-name) "dev-digital")
         (string= (system-name) "violet")
         (string= (system-name) "viridian")))
#+end_src

The following is true is Emacs is run on a remote server where I don't need stuff like my org workflow
#+begin_src emacs-lisp
  (setq my/remote-server
        (or (string= (getenv "IS_REMOTE") "true")
            (string= (system-name) "dev-digital")
            (string= (system-name) "violet")
            (string= (system-name) "viridian")))
#+end_src

And the following is true if Emacs is run from termux on Android.
#+begin_src emacs-lisp
(setq my/is-termux (string-match-p (rx (* nonl) "com.termux" (* nonl)) (getenv "HOME")))
#+end_src

Also, I sometimes need to know if a program is running inside Emacs (say, inside a terminal emulator). To do that, I set the following environment variable:
#+begin_src emacs-lisp
(setenv "IS_EMACS" "true")
#+end_src

Finally, I want to have a minimal Emacs config for debugging purposes. This has just straight.el, use-packages, and evil.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init-minimal.el :noweb yes
<<minimal>>
#+end_src

To launch Emacs with this config, run
#+begin_src bash :eval no :tangle no
emacs -q -l ~/.emacs.d/init-minimal.el
#+end_src
** Performance
